let arTun = [
  {
    "city": " طقس أريانة",
    "lat": 36.8587351,
    "lng": 10.188232
  },
  {
    "city": "طقس القصرين",
    "lat": 35.1687646,
    "lng": 8.8365654
  },
  {
    "city": "طقس القيروان",
    "lat": 35.6710101,
    "lng": 10.10062
  },
  {
    "city": "طقس الكاف",
    "lat": 36.153639999999996,
    "lng": 8.608292440571825
  },
  {
    "city": "طقس المنستير",
    "lat": 35.7707582,
    "lng": 10.8280511
  },
  {
    "city": "طقس المهدية",
    "lat": 35.5042799,
    "lng": 11.06858500822606
  },
  {
    "city": "طقس باجة",
    "lat": 36.7236241,
    "lng": 9.1853919
  },
  {
    "city": "طقس بن عروس",
    "lat": 36.63064825,
    "lng": 10.210082703817534
  },
  {
    "city": "طقس بنزرت",
    "lat": 37.2720905,
    "lng": 9.8708565
  },
  {
    "city": "طقس تطاوين",
    "lat": 32.9315727,
    "lng": 10.450413
  },
  {
    "city": "طقس توزر",
    "lat": 33.984410499999996,
    "lng": 8.07113085067842
  },
  {
    "city": "طقس تونس",
    "lat": 33.8439408,
    "lng": 9.400138
  },
  {
    "city": "طقس جندوبة",
    "lat": 36.4968705,
    "lng": 8.7763973
  },
  {
    "city": "طقس زغوان",
    "lat": 36.3994751,
    "lng": 10.1446349
  },
  {
    "city": "طقس سليانة",
    "lat": 36.0846651,
    "lng": 9.3743733
  },
  {
    "city": "طقس سوسة",
    "lat": 35.8288175,
    "lng": 10.6405392
  },
  {
    "city": "طقس سيدي بوزيد",
    "lat": 34.881181,
    "lng": 9.526359847182345
  },
  {
    "city": "طقس صفاقس",
    "lat": 34.723238699999996,
    "lng": 10.335847425638779
  },
  {
    "city": "طقس قابس",
    "lat": 33.7765032,
    "lng": 9.793062965576159
  },
  {
    "city": "طقس قبلي",
    "lat": 33.7061148,
    "lng": 8.9698376
  },
  {
    "city": "طقس قفصة",
    "lat": 34.43367,
    "lng": 8.79079875204918
  },
  {
    "city": "طقس مدنين",
    "lat": 33.3434014,
    "lng": 10.4910703
  },
  {
    "city": "طقس منوبة",
    "lat": 36.8128294,
    "lng": 10.091944256580737
  },
  {
    "city": "طقس نابل",
    "lat": 36.4512897,
    "lng": 10.7355915
  }
]

let frTun = [
  {
    "city": "Météo Ariana",
    "lat": 36.8587351,
    "lng": 10.188232
  },
  {
    "city": "Météo Beja",
    "lat": 35.1687646,
    "lng": 8.8365654
  },
  {
    "city": "Météo Ben Arous",
    "lat": 35.6710101,
    "lng": 10.10062
  },
  {
    "city": "Météo Bizerte",
    "lat": 36.153639999999996,
    "lng": 8.608292440571825
  },
  {
    "city": "Météo Gabes",
    "lat": 35.7707582,
    "lng": 10.8280511
  },
  {
    "city": "Météo Gafsa",
    "lat": 35.5042799,
    "lng": 11.06858500822606
  },
  {
    "city": "Météo Jendouba",
    "lat": 36.7236241,
    "lng": 9.1853919
  },
  {
    "city": "Météo Kairouan",
    "lat": 36.63064825,
    "lng": 10.210082703817534
  },
  {
    "city": "Météo Kasserine",
    "lat": 37.2720905,
    "lng": 9.8708565
  },
  {
    "city": "Météo Kebili",
    "lat": 32.9315727,
    "lng": 10.450413
  },
  {
    "city": "Météo Kef",
    "lat": 33.984410499999996,
    "lng": 8.07113085067842
  },
  {
    "city": "Météo Mahdia",
    "lat": 33.8439408,
    "lng": 9.400138
  },
  {
    "city": "Météo Manouba",
    "lat": 36.4968705,
    "lng": 8.7763973
  },
  {
    "city": "Météo Medenine",
    "lat": 36.3994751,
    "lng": 10.1446349
  },
  {
    "city": "Météo Monastir",
    "lat": 36.0846651,
    "lng": 9.3743733
  },
  {
    "city": "Météo Nabeul",
    "lat": 35.8288175,
    "lng": 10.6405392
  },
  {
    "city": "Météo Sfax",
    "lat": 34.881181,
    "lng": 9.526359847182345
  },
  {
    "city": "Météo Sidi Bouzid",
    "lat": 34.723238699999996,
    "lng": 10.335847425638779
  },
  {
    "city": "Météo Siliana",
    "lat": 33.7765032,
    "lng": 9.793062965576159
  },
  {
    "city": "Météo Sousse",
    "lat": 33.7061148,
    "lng": 8.9698376
  },
  {
    "city": "Météo Tataouine",
    "lat": 34.43367,
    "lng": 8.79079875204918
  },
  {
    "city": "Météo Tozeur",
    "lat": 33.3434014,
    "lng": 10.4910703
  },
  {
    "city": "Météo Tunis",
    "lat": 36.8128294,
    "lng": 10.091944256580737
  },
  {
    "city": "Météo Zaghouan",
    "lat": 36.4512897,
    "lng": 10.7355915
  }
]

let all = [
  {
    "city": " طقس أريانة",
    "lat": 36.8587351,
    "lng": 10.188232
  },
  {
    "city": "طقس القصرين",
    "lat": 35.1687646,
    "lng": 8.8365654
  },
  {
    "city": "طقس القيروان",
    "lat": 35.6710101,
    "lng": 10.10062
  },
  {
    "city": "طقس الكاف",
    "lat": 36.153639999999996,
    "lng": 8.608292440571825
  },
  {
    "city": "طقس المنستير",
    "lat": 35.7707582,
    "lng": 10.8280511
  },
  {
    "city": "طقس المهدية",
    "lat": 35.5042799,
    "lng": 11.06858500822606
  },
  {
    "city": "طقس باجة",
    "lat": 36.7236241,
    "lng": 9.1853919
  },
  {
    "city": "طقس بن عروس",
    "lat": 36.63064825,
    "lng": 10.210082703817534
  },
  {
    "city": "طقس بنزرت",
    "lat": 37.2720905,
    "lng": 9.8708565
  },
  {
    "city": "طقس تطاوين",
    "lat": 32.9315727,
    "lng": 10.450413
  },
  {
    "city": "طقس توزر",
    "lat": 33.984410499999996,
    "lng": 8.07113085067842
  },
  {
    "city": "طقس تونس",
    "lat": 33.8439408,
    "lng": 9.400138
  },
  {
    "city": "طقس جندوبة",
    "lat": 36.4968705,
    "lng": 8.7763973
  },
  {
    "city": "طقس زغوان",
    "lat": 36.3994751,
    "lng": 10.1446349
  },
  {
    "city": "طقس سليانة",
    "lat": 36.0846651,
    "lng": 9.3743733
  },
  {
    "city": "طقس سوسة",
    "lat": 35.8288175,
    "lng": 10.6405392
  },
  {
    "city": "طقس سيدي بوزيد",
    "lat": 34.881181,
    "lng": 9.526359847182345
  },
  {
    "city": "طقس صفاقس",
    "lat": 34.723238699999996,
    "lng": 10.335847425638779
  },
  {
    "city": "طقس قابس",
    "lat": 33.7765032,
    "lng": 9.793062965576159
  },
  {
    "city": "طقس قبلي",
    "lat": 33.7061148,
    "lng": 8.9698376
  },
  {
    "city": "طقس قفصة",
    "lat": 34.43367,
    "lng": 8.79079875204918
  },
  {
    "city": "طقس مدنين",
    "lat": 33.3434014,
    "lng": 10.4910703
  },
  {
    "city": "طقس منوبة",
    "lat": 36.8128294,
    "lng": 10.091944256580737
  },
  {
    "city": "طقس نابل",
    "lat": 36.4512897,
    "lng": 10.7355915
  },
  {
    "city": "Météo Ariana",
    "lat": 36.8587351,
    "lng": 10.188232
  },
  {
    "city": "Météo Beja",
    "lat": 35.1687646,
    "lng": 8.8365654
  },
  {
    "city": "Météo Ben Arous",
    "lat": 35.6710101,
    "lng": 10.10062
  },
  {
    "city": "Météo Bizerte",
    "lat": 36.153639999999996,
    "lng": 8.608292440571825
  },
  {
    "city": "Météo Gabes",
    "lat": 35.7707582,
    "lng": 10.8280511
  },
  {
    "city": "Météo Gafsa",
    "lat": 35.5042799,
    "lng": 11.06858500822606
  },
  {
    "city": "Météo Jendouba",
    "lat": 36.7236241,
    "lng": 9.1853919
  },
  {
    "city": "Météo Kairouan",
    "lat": 36.63064825,
    "lng": 10.210082703817534
  },
  {
    "city": "Météo Kasserine",
    "lat": 37.2720905,
    "lng": 9.8708565
  },
  {
    "city": "Météo Kebili",
    "lat": 32.9315727,
    "lng": 10.450413
  },
  {
    "city": "Météo Kef",
    "lat": 33.984410499999996,
    "lng": 8.07113085067842
  },
  {
    "city": "Météo Mahdia",
    "lat": 33.8439408,
    "lng": 9.400138
  },
  {
    "city": "Météo Manouba",
    "lat": 36.4968705,
    "lng": 8.7763973
  },
  {
    "city": "Météo Medenine",
    "lat": 36.3994751,
    "lng": 10.1446349
  },
  {
    "city": "Météo Monastir",
    "lat": 36.0846651,
    "lng": 9.3743733
  },
  {
    "city": "Météo Nabeul",
    "lat": 35.8288175,
    "lng": 10.6405392
  },
  {
    "city": "Météo Sfax",
    "lat": 34.881181,
    "lng": 9.526359847182345
  },
  {
    "city": "Météo Sidi Bouzid",
    "lat": 34.723238699999996,
    "lng": 10.335847425638779
  },
  {
    "city": "Météo Siliana",
    "lat": 33.7765032,
    "lng": 9.793062965576159
  },
  {
    "city": "Météo Sousse",
    "lat": 33.7061148,
    "lng": 8.9698376
  },
  {
    "city": "Météo Tataouine",
    "lat": 34.43367,
    "lng": 8.79079875204918
  },
  {
    "city": "Météo Tozeur",
    "lat": 33.3434014,
    "lng": 10.4910703
  },
  {
    "city": "Météo Tunis",
    "lat": 36.8128294,
    "lng": 10.091944256580737
  },
  {
    "city": "Météo Zaghouan",
    "lat": 36.4512897,
    "lng": 10.7355915
  }
]